function showInfo(test) {

  if (test === "hba1c") {
    alert(
      "HbA1c أو السكر التراكمي يساعد على متابعة متوسط مستوى السكر خلال الفترة السابقة."
    );
  }

  if (test === "fbs") {
    alert(
      "FBS هو تحليل سكر الدم الصائم، ويقيس مستوى السكر بعد الصيام حسب تعليمات المختبر."
    );
  }

  if (test === "random") {
    alert(
      "سكر الدم العشوائي يقيس مستوى الجلوكوز في الدم في وقت غير مرتبط بالصيام."
    );
  }

  if (test === "ogtt") {
    alert(
      "اختبار تحمل الجلوكوز يقيس استجابة الجسم للجلوكوز وفق خطوات وتعليمات محددة."
    );
  }

}
